#include <iostream>
#include <clocale> // Для setlocale()
#include <stdlib.h> // Для функции srand()
#include <time.h> // Для функции time()

int main(){
	
	setlocale(LC_ALL, "Russian"); // Windows enterprice ltsc всё перепробовал - не работает
	// поэтому перехожу на stupid English
	
	//-------------------------------------------------------------
	// ------- Задание 1: -----------------------------------------
	//-------------------------------------------------------------
	
	int a = 10;
	int b = 20;
	int c = 30;
	int d = 40;
	
	float ANS_1 = a * (b + (float(c) / d));
	
	std::cout << "First answer: " << ANS_1 << std::endl;
	
	//-------------------------------------------------------------
	// ------- Задание 2: -----------------------------------------
	//-------------------------------------------------------------
	
	srand(time(NULL)); // Для получения случайного числа, зависимое
	// от времени запуска программы
	
	int N = rand() % 42; // 41 - для равномерного распределения "влево-вправо"
	
	int ANS_2 = (N <= 21) ? 21 - N : N / 21 + N % 21;
	
	std::cout << "Generated number: " << N << std::endl;
	std::cout << "Second answer: " << ANS_2 << std::endl;
	
	//-------------------------------------------------------------
	// ------- Задание 3: -----------------------------------------
	//-------------------------------------------------------------
	
	int array[3][3][3] = {
	{{1,  2,  3},  {4,  5,  6},  {7,  8,  9}},
	{{10, 11, 12}, {13, 14, 15}, {16, 17, 18}},
	{{19, 20, 21}, {22, 23, 24}, {25, 26, 27}}
	};
	
	
	int * ptrArr = nullptr;
	ptrArr = & array[0][0][0];
	
	std::cout << "Value of the central cell: " << ptrArr[13] << std::endl;
	
	// Здесь я не совсем понял, почему ptrArr[13], а не ptrArr[1][1][1]:
	// То есть указатель хранит многомерный массив в виде одномерного?
	// И я не понял что значит "разыменовать указатель" - обратиться к 
	// переменной через указатель? Я правильно сделал на выводе?
	
	system("pause");
	return 0;
}